//// 2kurs-pedag.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
////
//
//#define WIDTH 5
//
//#include <iostream>
//using namespace std;
//
//const double G = 9.86;
//
//void func() {
//    cout << "func" << endl;
//}
//
//int sum(const int m, const int n) {
//
//    return m + n;
//}
//
//int oddSum(int arr[], int n) {
//    int sum = 0;
//    //for (int i = 0; i < n; i++)
//    //{
//    //    if (i % 2 == 1) {
//    //        sum += arr[i];
//    //    }
//    //}
//
//    for (int i = 1; i < n; i+=2)
//    {
//        sum += arr[i];
//    }
//
//    return sum;
//}
//
//int main()
//{
//    //cout << "Hello World!\n";
//    //char str[50];
//
//    //cin >> str;
//
//    //int n = 10;
//    //unsigned int m = 100; // беззнаковый
//
//    //double d = 0.0;
//
//    //int k;
//
//    //if (n == 10 && m > 50 ) {
//    //    cout << "good" << endl;
//    //}
//    //else {
//    //    if (m > 90) cout << "normal";
//    //    cout << "bad" << endl;
//    //}
//    //// && - and ; || - or; ! - negative
//    //// ==, >=, <=, <, >, !=
//    //if (n >= 1) {
//
//    //}
//    //else if (n == 2) {
//
//    //}
//    //else if (n == 3) {
//
//    //}
//    //else {
//
//    //}
//    //int num;
//    //cin >> num;
//    //switch (num)
//    //{
//    //case 0:
//    //case 1:
//    //    cout << "green";
//    //    break;
//    //default:
//    //    cout << "default";
//    //    break;
//    //}
//
//    //while (n >= 0) {
//    //    cout << n << endl;
//    //    n--; // n = n - 1
//    //}
//
//    //do {
//    //    n++;
//    //} while (n < 10);
//
//    //for (int i = 0; i < n; i++) {
//    //    cout << i << endl;
//    //}
//
//    //int arr[10];
//
//    //int arr2[] = { 1, 2, 3, 5, 6 };
//
//    //cout << arr2[0] << endl;
//
//    //int twoDemArr[2][2] = { {1, 2}, {3, 4} };
//
//    //twoDemArr[1][0];
//
//    //int sum_n_k = sum(n, k);
//
//    //func();
//
//    const int l = 6;
//    int arr[l] = { 3, 41, 42, 123, 4, 4 };
//
//    cout << oddSum(arr, l) << endl;
//
//}
//
//// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
//// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"
//
//// Советы по началу работы 
////   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
////   2. В окне Team Explorer можно подключиться к системе управления версиями.
////   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
////   4. В окне "Список ошибок" можно просматривать ошибки.
////   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
////   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
